cases/t3am_ko/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          PCG;
	preconditioner	DIC;
        tolerance       1e-8;
        relTol          0.001;
//        smoother        GaussSeidel;
    }

    "(U|k|omega)"
    {
        solver          PBiCGStab;
        preconditioner        DILU;
        tolerance       1e-8;
        relTol          0.01;
//        maxIter         10;
    }
}

SIMPLE
{
    consistent      yes;

    residualControl
    {
        p               1e-8;
        U               1e-8;
        "(k|omega)" 1e-8;
    }
}

relaxationFactors
{
    equations
    {
        p            0.4;
	"(U|k|omega)" 0.8;
    }
}


// ************************************************************************* //
